{
  "backend/main.mo": "Defines product, blog, order, and user profile types with authorization and storage mixins, and exposes queries/mutations for profiles and product filtering.",
  "feature_evidence.json": "Lists feature reports mapping feature IDs to affected frontend files, components, test IDs, and confidence ratings.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base layer defining color tokens, theme variables, and dark mode overrides for the site's design system.",
  "frontend/index.html": "HTML entry point with meta tags, favicon, root mount point, and script loader for the frontend app.",
  "frontend/src/App.tsx": "Main router setup defining all public and admin routes with shared layout including header and footer.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button using Internet Identity with login/logout handling and query cache clearing.",
  "frontend/src/components/cart/CartSheet.tsx": "Slide‑in cart panel showing items, quantity controls, subtotal, and navigation to checkout.",
  "frontend/src/components/catalog/ProductCard.tsx": "Displays a product card with image, pricing, badges, and wishlist toggle functionality.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, navigation links, and contact details.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides the main site header with navigation, user actions, cart access, and mobile menu handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, blog posts, user profiles, wishlist, and other backend data.",
  "frontend/src/index.css": "Defines global Tailwind layers, CSS variables for light/dark themes, typography, animations, and utility classes for layout and transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Displays user account info and order history, fetching profile and orders via hooks.",
  "frontend/src/pages/admin/AdminBlogPage.tsx": "Placeholder page for future blog management interface.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard displaying product, blog, order, and message statistics.",
  "frontend/src/pages/admin/AdminDesignsPage.tsx": "Placeholder page for future designs management interface.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Defines admin panel layout with access control, navigation sidebar, and routed content area.",
  "frontend/src/pages/admin/AdminMessagesPage.tsx": "Placeholder page for future user message management.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Placeholder page for future order management interface.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Static admin page placeholder showing a heading and coming-soon message for product management.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Static admin settings page displaying a heading and coming-soon message.",
  "frontend/src/pages/BlogListPage.tsx": "Lists blog posts with search, category filtering, and a featured article section.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a full blog article with sharing, metadata, and related posts.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including shipping form, order submission, and cart clearing.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation, honeypot spam check, and contact info display.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero banner, featured products, brand info, and previews of new designs.",
  "frontend/src/pages/NewDesignsPage.tsx": "Shows newest and limited‑edition products with loading states and sectioned product grids.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with message and button linking back home.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation with order ID, thank‑you message, and navigation buttons.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info, wishlist/cart actions, image, description, and related products.",
  "frontend/src/pages/ShopPage.tsx": "Provides product filtering by category, price, gold type, stone type, and sorting, displaying filtered results.",
  "frontend/src/pages/WishlistPage.tsx": "Shows user wishlist items or prompts sign‑in, with product grid and loading states.",
  "frontend/src/state/cart.ts": "Zustand store managing cart items with add, remove, update, clear, and subtotal logic persisted to session storage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, colors, fonts, animations, and enabling plugins for the project's design system.",
  "project_state.json": "Project-level metadata describing AMOR’s goals, architecture, features, and known issues."
}